In [1]:
import pandas as pd

In [23]:
data = {
    'names' : ['Sachin','Dhoni','Virat','Sehwag','Yuvi','Bhuvi','Ishant'],
    'scores' : [67,45,109,121,12,None,None]
}

In [24]:
s = pd.Series(data)

In [25]:
type(s)

pandas.core.series.Series

In [26]:
s

names     [Sachin, Dhoni, Virat, Sehwag, Yuvi, Bhuvi, Is...
scores                   [67, 45, 109, 121, 12, None, None]
dtype: object

In [27]:
df = pd.DataFrame(data)

In [28]:
df

    names  scores
0  Sachin    67.0
1   Dhoni    45.0
2   Virat   109.0
3  Sehwag   121.0
4    Yuvi    12.0
5   Bhuvi     NaN
6  Ishant     NaN

In [29]:
s[0]

['Sachin', 'Dhoni', 'Virat', 'Sehwag', 'Yuvi', 'Bhuvi', 'Ishant']

In [30]:
s[1]

[67, 45, 109, 121, 12, None, None]

In [31]:
s.names

['Sachin', 'Dhoni', 'Virat', 'Sehwag', 'Yuvi', 'Bhuvi', 'Ishant']

In [32]:
df['names']

0    Sachin
1     Dhoni
2     Virat
3    Sehwag
4      Yuvi
5     Bhuvi
6    Ishant
Name: names, dtype: object

In [33]:
print(df['names'][0], df['scores'][0])

Sachin 67.0

In [34]:
df.head(3)

    names  scores
0  Sachin    67.0
1   Dhoni    45.0
2   Virat   109.0

In [35]:
df.head()

    names  scores
0  Sachin    67.0
1   Dhoni    45.0
2   Virat   109.0
3  Sehwag   121.0
4    Yuvi    12.0

In [36]:
df.shape

(7, 2)

In [37]:
df.columns

Index(['names', 'scores'], dtype='object')

In [38]:
df.tail()

    names  scores
2   Virat   109.0
3  Sehwag   121.0
4    Yuvi    12.0
5   Bhuvi     NaN
6  Ishant     NaN

In [40]:
df.isnull()

   names  scores
0  False   False
1  False   False
2  False   False
3  False   False
4  False   False
5  False    True
6  False    True

In [41]:
s.isnull()

names     False
scores    False
dtype: bool

In [46]:
data_1 = ['Ind','Pak','China','Aus','USA','UK','Italy',None,None,'Sri Lanka']

s = pd.Series(data_1)

In [47]:
s

0          Ind
1          Pak
2        China
3          Aus
4          USA
5           UK
6        Italy
7         None
8         None
9    Sri Lanka
dtype: object

In [48]:
s.head()

0      Ind
1      Pak
2    China
3      Aus
4      USA
dtype: object

In [49]:
s.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
9    False
dtype: bool

In [50]:
s[0]

'Ind'

In [51]:
s[0:7]

0      Ind
1      Pak
2    China
3      Aus
4      USA
5       UK
6    Italy
dtype: object

In [52]:
df

    names  scores
0  Sachin    67.0
1   Dhoni    45.0
2   Virat   109.0
3  Sehwag   121.0
4    Yuvi    12.0
5   Bhuvi     NaN
6  Ishant     NaN

In [54]:
df[df['names'] == 'Virat']

   names  scores
2  Virat   109.0

In [56]:
df[df['scores'] > 50]

    names  scores
0  Sachin    67.0
2   Virat   109.0
3  Sehwag   121.0

In [63]:
df.iloc[0:3,0:2]

    names  scores
0  Sachin    67.0
1   Dhoni    45.0
2   Virat   109.0

In [66]:
df.sort_values('scores', ascending=False)

    names  scores
3  Sehwag   121.0
2   Virat   109.0
0  Sachin    67.0
1   Dhoni    45.0
4    Yuvi    12.0
5   Bhuvi     NaN
6  Ishant     NaN